tutorials/fluidSolidInteraction/perpendicularFlap.jfnk/constant/fluid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    fluidMesh
    {
        // type        neoHookeanElastic;
        // rho         rho [1 -3 0 0 0 0 0] 1;
        // mu          mu [1 -1 -2 0 0 0 0] 1;
        // K           K [1 -1 -2 0 0 0 0] 2;
        // regionName  fluid;

        // type        diffusionElastic;
        type        diffusionHyperElastic;
        rho         rho [1 -3 0 0 0 0 0] 1;
        mu          mu [1 -1 -2 0 0 0 0] 1;
        //kappa       kappa [1 -1 -2 0 0 0 0] 3;
        K           K [1 -1 -2 0 0 0 0] 1;
        regionName  fluid;
        diffusivity quadratic inverseDistance
        (
            // inlet outlet flap upperWall lowerWall
            flap lowerWall
        );
        // diffusivity inverseDistance (interface);
        //diffusivity uniform;

        // Maximum and minimum values for the stiffness-scaling field relative
        // to the average
        //maxFactor    100;
        // minFactor    0.1;

        writeStiffScaleFactor no;

        // type        linearElastic;
        // rho         rho [1 -3 0 0 0 0 0] 1;
        // E           E [1 -1 -2 0 0 0 0] 1;
        // nu          nu [0 0 0 0 0 0 0] 0.3;
        // regionName  meshMotionFluid;
    }
);

// ************************************************************************* //
