tutorials/fluidSolidInteraction/perpendicularFlap.jfnk/system/solid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

d2dt2Schemes
{
    //default                 steadyState;
    //default                 Euler;
    default                 none;
    d2dt2(D)                backward;
}

ddtSchemes
{
    // default                 backward;
    default                 none; //Euler;
    d2dt2(D)                backward;
    ddt(D)                  backward;
}

gradSchemes
{
    default                 leastSquaresS4f;
}

divSchemes
{
    default                 none; //Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear corrected;
}

snGradSchemes
{
    default                 corrected;
}

interpolationSchemes
{
    default                 linear;
}

// ************************************************************************* //
